Feature: G마켓 SRP 트래킹 로그 정합성 검증
  검색 결과 페이지에서 상품 클릭 시 트래킹 로그의 정합성을 검증합니다.

  Scenario: 최상단 클릭아이템 모듈 상품 클릭 시 트래킹 로그 검증
    Given G마켓 홈 페이지에 접속했음
    And 네트워크 트래킹이 시작되었음
    When 사용자가"세탁세재""3386025906" 최상단 클릭아이템 모듈 패이지로 이동한다
    Then 검색 결과 페이지가 표시된다
    Given 검색 결과 페이지에 "최상단 클릭아이템" 모듈이 있다
    When 사용자가 "최상단 클릭아이템" 모듈 내 1번째 상품을 확인하고 클릭한다
    Then 상품 페이지로 이동되었다
    Then 모든 트래킹 로그를 JSON 파일로 저장함
    Then Module Exposure 로그가 정합성 검증을 통과해야 함 (TC: C1228816)
    And Product Exposure 로그가 정합성 검증을 통과해야 함 (TC: C1228817)
    And Product Click 로그가 정합성 검증을 통과해야 함 (TC: C1228819)
    And Product ATC Click 로그가 정합성 검증을 통과해야 함 (TC: C1228820)

  Scenario: 검색 결과 페이지에서 모듈별 상품 클릭 시 트래킹 로그 검증
    Given G마켓 홈 페이지에 접속했음
    And 네트워크 트래킹이 시작되었음
    When 사용자가 "<keyword>"을 검색한다
    Then 검색 결과 페이지가 표시된다
    Given 사용자가 "<keyword>"을 검색했다
    And 검색 결과 페이지에 "<module_title>" 모듈이 있다
    When 사용자가 "<module_title>" 모듈 내 1번째 상품을 확인하고 클릭한다
    Then 상품 페이지로 이동되었다
    Then 모든 트래킹 로그를 JSON 파일로 저장함
    Then Module Exposure 로그가 정합성 검증을 통과해야 함 (TC: <tc_module_exposure>)
    And Product Exposure 로그가 정합성 검증을 통과해야 함 (TC: <tc_product_exposure>)
    And Product Click 로그가 정합성 검증을 통과해야 함 (TC: <tc_product_click>)
    And Product ATC Click 로그가 정합성 검증을 통과해야 함 (TC: <tc_atc_click>)

    Examples:
      | keyword          | module_title      | tc_module_exposure | tc_product_exposure | tc_product_click | tc_atc_click   |
      | 물티슈            | 0번 구좌          | C1228822           | C1228823            | C1228825         | C1228826       |
      | 물티슈            | 먼저 둘러보세요   | C1228828           | C1228829            | C1228831         | C1228832       |
      | 물티슈            | 인기 상품이에요   | C1228840           | C1228841            | C1228843         | C1228844       |
      | 물티슈            | 오늘의 상품이에요 | C1228834           | C1228835            | C1228837         | C1228838       |
      | 생수              | 오늘의 슈퍼딜     | C1228852           | C1228853            | C1228855        |                |
      | 생수              | 스타배송          | C1166841           | C1166841            | C1166841         | C1166841       |
      | 물티슈            | 일반상품          | C1228856           | C1228857           | C1228859        | C1228860       |
      | 물티슈            | 장바구니 모듈     | C1228806           | C1228807            | C1228811         | C1228812       |
      | 물티슈            | 카탈로그 모듈     | C1228846           | C1228847            | C1228849         | C1228850       |
      | 메가커피 1만원    | 대체검색어        | C1228902           | C1228903            | C1228905         | C1228906       |
      | 34123124351234    | G마켓 인기 상품   | C1228896           | C1228897            | C1228899         | C1228900       |
      | 아디다스          | 백화점 브랜드     | C1228874           | C1228875            | C1228877         |                |
      | 원피스            | 4.5 이상          | C1228886           | C1228887            | C1228889         |                |
      | LG전자            | 브랜드 인기상품   | C1228882           | C1228883            | C1228885         |                |
      | 쿤달              | MD's Pick        | C1228890           | C1228891            | C1228893         | C1228894      |
      | 반팔티            | 백화점픽         | C1228878           | C1228879            | C1228881         |                |
      | 물티슈            | 최하단캐러셀      | C1228866           | C1228867            | C1228869         |                |
      | 물티슈            | 연관키워드       | C1228862           | C1228863            | C1228865         |                |


      
     